In [2]:
import pandas as pd
import numpy as np

Create Data using numpy

In [12]:
data=np.arange(0,20)
#reshape this rray into a matrix
data=data.reshape(5,4) #5 rows and 4 columns

Creating DataFrame

In [15]:
df=pd.DataFrame(data,index=["Row1","Row2","Row3","Row4","Row5"],columns=["Col1","Col2","Col3","Col4"])
print(df)

      Col1  Col2  Col3  Col4
Row1     0     1     2     3
Row2     4     5     6     7
Row3     8     9    10    11
Row4    12    13    14    15
Row5    16    17    18    19

Check for the First 5 Rows and first 5 columns

In [16]:
df.head()   #display first 5 rows of dataFrame

      Col1  Col2  Col3  Col4
Row1     0     1     2     3
Row2     4     5     6     7
Row3     8     9    10    11
Row4    12    13    14    15
Row5    16    17    18    19

In [17]:
df.tail() #display lst five rows of dataFrame

      Col1  Col2  Col3  Col4
Row1     0     1     2     3
Row2     4     5     6     7
Row3     8     9    10    11
Row4    12    13    14    15
Row5    16    17    18    19

In [ ]:
#can be customized to display any number of rows
df.head(2) #dispay first 2 rows

      Col1  Col2  Col3  Col4
Row1     0     1     2     3
Row2     4     5     6     7

In [ ]:
df.tail(2) #last 2 rows

      Col1  Col2  Col3  Col4
Row4    12    13    14    15
Row5    16    17    18    19

In [20]:
type(df)

pandas.core.frame.DataFrame

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, Row1 to Row5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Col1    5 non-null      int32
 1   Col2    5 non-null      int32
 2   Col3    5 non-null      int32
 3   Col4    5 non-null      int32
dtypes: int32(4)
memory usage: 120.0+ bytes

In [22]:
df.describe()

            Col1       Col2       Col3       Col4
count   5.000000   5.000000   5.000000   5.000000
mean    8.000000   9.000000  10.000000  11.000000
std     6.324555   6.324555   6.324555   6.324555
min     0.000000   1.000000   2.000000   3.000000
25%     4.000000   5.000000   6.000000   7.000000
50%     8.000000   9.000000  10.000000  11.000000
75%    12.000000  13.000000  14.000000  15.000000
max    16.000000  17.000000  18.000000  19.000000

Indexing using Column Names

In [25]:
#use single brackets when acess only one column
df["Col1"]

Row1     0
Row2     4
Row3     8
Row4    12
Row5    16
Name: Col1, dtype: int32

In [24]:
#we use nested brackets when we have to access more than 1 column
df[["Col1","Col2"]]

      Col1  Col2
Row1     0     1
Row2     4     5
Row3     8     9
Row4    12    13
Row5    16    17

Indexing using Row Names (loc)

In [ ]:
df.loc["Row1"] #single row

Col1    0
Col2    1
Col3    2
Col4    3
Name: Row1, dtype: int32

In [29]:
df.loc[["Row1","Row2"]] #multiple row

      Col1  Col2  Col3  Col4
Row1     0     1     2     3
Row2     4     5     6     7

Accessing by proper index number

In [30]:
df.head()

      Col1  Col2  Col3  Col4
Row1     0     1     2     3
Row2     4     5     6     7
Row3     8     9    10    11
Row4    12    13    14    15
Row5    16    17    18    19

In [33]:
df.iloc[2:4,0:2] #element from 2nd row to 3rd and oth olumn to 1st

      Col1  Col2
Row3     8     9
Row4    12    13

In [34]:
df.iloc[2:,1:]

      Col2  Col3  Col4
Row3     9    10    11
Row4    13    14    15
Row5    17    18    19

In [35]:
df.head()

      Col1  Col2  Col3  Col4
Row1     0     1     2     3
Row2     4     5     6     7
Row3     8     9    10    11
Row4    12    13    14    15
Row5    16    17    18    19

In [37]:
df.iloc[0:,3:]

      Col4
Row1     3
Row2     7
Row3    11
Row4    15
Row5    19

In [38]:
df.head()

      Col1  Col2  Col3  Col4
Row1     0     1     2     3
Row2     4     5     6     7
Row3     8     9    10    11
Row4    12    13    14    15
Row5    16    17    18    19

#Convert dataframe into array

In [40]:
df.iloc[:,1:].values

array([[ 1,  2,  3],
       [ 5,  6,  7],
       [ 9, 10, 11],
       [13, 14, 15],
       [17, 18, 19]])

Basic Operations

In [41]:
#check if there is null values in df
df.isnull().sum()

Col1    0
Col2    0
Col3    0
Col4    0
dtype: int64

In [43]:
df1 = pd.DataFrame(
    data=[[1, np.nan, 2], [4, 5, 6]],
    index=["Row1", "Row2"],
    columns=["col1", "col2", "col3"]
)
df1

      col1  col2  col3
Row1     1   NaN     2
Row2     4   5.0     6

In [44]:
df1.isnull().sum()

col1    0
col2    1
col3    0
dtype: int64

In [45]:
df1.isnull()

       col1   col2   col3
Row1  False   True  False
Row2  False  False  False

In [46]:
df.head()

      Col1  Col2  Col3  Col4
Row1     0     1     2     3
Row2     4     5     6     7
Row3     8     9    10    11
Row4    12    13    14    15
Row5    16    17    18    19

In [48]:
df["Col3"].value_counts() #ount for particular values occured in a column

Col3
2     1
6     1
10    1
14    1
18    1
Name: count, dtype: int64